testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_10000000____delay-ms_1____loss-rate-percent_1____clients-requests_10/2/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.87s, 5.34 req/s, 50.95MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 95.40MB (100031270) total, 120B (120) headers (space savings 87.37%), 95.37MB (100000000) data
UDP datagram: 6947 sent, 82185 received
                     min         max         mean         sd        +/- sd
time for request:      1.21s       1.84s       1.53s    199.43ms    70.00%
time for connect:     6.22ms     28.53ms     17.08ms      7.64ms    60.00%
time to 1st byte:    28.15ms    137.22ms     40.25ms     34.09ms    90.00%
req/s           :       0.53        0.82        0.66        0.09    70.00%